{
    "weapons": [
      {
        "id": 1,
        "picture": "weapon-images/longsword.png",
        "name": "Longsword",
        "description": "The most popular HEMA weapon and most seen on all HEMA tournaments and trainings alike. It is a well balanced, light and nimble weapon, weighing around 1.6-1.7kg. It provides both great offence and defence."
      },
      {
        "id": 2,
        "picture": "weapon-images/sidesword.png",
        "name": "Sidesword",
        "description": "Another very popular weapon in HEMA, the sidesword has a shorter reach than a longsword but makes up for it with speed. It is used in different categories: one-handed, \"Sword and buckler\", and \"Sword and dagger\""
      },
      {
        "id": 3,
        "picture": "weapon-images/rapier.png",
        "name": "Rapier",
        "description": "The rapier is one of the most popular choices for a new HEMA practicioner. It has a similar size to the longsword but the blade is much longer compared to the handle. The weapon is slim and perfect for thrusting."
      },
      {
        "id": 4,
        "picture": "weapon-images/messer.png",
        "name": "Messer",
        "description": "Least used in HEMA, but with the most interesting backstory. Since swords were not allowed to be carried in medieval times, this long knife was a great solution for a common man to bypass the law."
      },
      {
        "id": 5,
        "picture": "weapon-images/saber.png",
        "name": "Saber",
        "description": "Fast and agile, the saber comes in many forms and sizes. It has been the favourite weapon of many militaries throughout history. Due to the shape of the blade, it is excellet for fast cutting motions."
      },
      {
        "id": 6,
        "picture": "weapon-images/dagger.png",
        "name": "Dagger",
        "description": "Modern knife combat differs from the medieval one (difference in gear and the weapon). The distance is greatly reduced in exchange for mobility. It is best used as offhand, with a sidesword or rapier."
      },
      {
        "id": 7,
        "picture": "weapon-images/spear.png",
        "name": "Spear",
        "description": "One of the most used weapons on the battlefields. If you ask any HEMA practicioner which weapon would they actually take to a real battle, the spear will be the answer. Superior range and easy to learn."
      },
      {
        "id": 8,
        "picture": "weapon-images/halberd.png",
        "name": "Halberd",
        "description": "Quite similar to the spear, but with a twist. This weapon is good at both thrusting and cutting as well, due to the shape of it's head. Just like with the spear, practice with this weapon is done slowly."
      },
      {
        "id": 9,
        "picture": "weapon-images/buckler.png",
        "name": "Buckler",
        "description": "The buckler might appear funny, but it is a fantastic offhand. The defence it provides and the size ratio is surprisingly good. It is mostly used with a sidesword, with specific techniques that utilize both."
      }
    ]
  }
  